package lesson_9_fields_static_final;

/*
* Используя задачу l7t5:
* 1. Вынесите поиск простых чисел в отдельный класс.
* 2. Реализуйте возможность вывода на экран суммы N первых простых чисел, где N – число, введенное пользователем с клавиатуры;
* 3. Вынесите нужные вам переменные в поля класса. Если необходимо – сделайте их константами уровня класса или объекта.
* Помните, константа ссылочного типа гарантирует неизменность ссылки, а не содержимого объекта. Массив – ссылочный тип.
*
* Примечание: это одна задача, а не различные варианты
*/

public class Task_3 {
}
